{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-converter v4.14.0",
  "convertedBy": "TensorFlow.js Converter",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "name": "input_1"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [3, 3],
            "activation": "relu",
            "padding": "same",
            "name": "conv2d_1"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "strides": [2, 2],
            "name": "max_pooling2d_1"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "name": "dense_1"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 2,
            "activation": "softmax",
            "name": "dense_2"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [3211264, 128],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [128, 2],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [2],
          "dtype": "float32"
        }
      ]
    }
  ],
  "signature": {
    "inputs": {
      "input_1": {
        "name": "input_1",
        "dtype": "float32",
        "tensorShape": [null, 224, 224, 3]
      }
    },
    "outputs": {
      "dense_2": {
        "name": "dense_2",
        "dtype": "float32",
        "tensorShape": [null, 2]
      }
    }
  }
}
